resource/request_file/Health/MaxBupa_Health_Customer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:GetUWDecision>
            <tem:strXML>
        <![CDATA[
            <APPLICATION_FORM>
                <CUST_PIVOTAL_APP_ID>___customer_id___</CUST_PIVOTAL_APP_ID>
                <CUST_NATIONALITY>Indian</CUST_NATIONALITY>
                <CUST_SUM_INSURED>___health_insurance_si___</CUST_SUM_INSURED>
                <CONT_PLAN_ID>___planCode___</CONT_PLAN_ID>
                <CUST_RENEW_FLAG>N</CUST_RENEW_FLAG>
                <PIV_RENEW_TYPE></PIV_RENEW_TYPE>
                <PARENT_APP_ID></PARENT_APP_ID>
                <PREV_CONT_PLAN_ID></PREV_CONT_PLAN_ID>
                <MB_IS_PORTABILITY>NO</MB_IS_PORTABILITY>
                <SOURCE_SYSTEM>Landmark</SOURCE_SYSTEM>
                <CHANNEL>TPD</CHANNEL>
                <SUB_CHANNEL></SUB_CHANNEL>
                <CITY_NAME>MUMBAI</CITY_NAME>
                <AGENT_CODE>BR00330027</AGENT_CODE>
                <AGENT_DOJ></AGENT_DOJ>
                <AGENT_EDUCATION></AGENT_EDUCATION>
                <AGENT_WORK_SCHEDULE></AGENT_WORK_SCHEDULE>
                <CUST_EDUCATION></CUST_EDUCATION>
                <CUST_OCCUPATION>___member_1_occupation___</CUST_OCCUPATION>
                <CONT_BUPA_BRANCH_LOC>Mumbai</CONT_BUPA_BRANCH_LOC>
                <PERMANENT_CITY_NAME>MUMBAI</PERMANENT_CITY_NAME>
                <CUST_IS_PEP>___proposer_pep___</CUST_IS_PEP>
                <CUST_PIN_CODE>___permanent_pincode___</CUST_PIN_CODE>
                <CUST_IS_SPLIT>No</CUST_IS_SPLIT>
                <INSURED_DETAILS>
                    <!--InsurersDetail_Start-->
                    <INSURED_DETAIL>
                        <PIV_MBR_ID>___member_array_id___</PIV_MBR_ID>
                        <MBR_MBRSHP_NO></MBR_MBRSHP_NO>
                        <WDMS_DEDUPE_MBR_ID></WDMS_DEDUPE_MBR_ID>
                        <MBR_DOB>___member_array_dob___</MBR_DOB>
                        <MBR_HEIGHT>___member_array_height___</MBR_HEIGHT>
                        <MBR_WEIGHT>___member_array_weight___</MBR_WEIGHT>
                        <MBR_NATIONALITY>Indian</MBR_NATIONALITY>
                        <MBR_PROPOSER_RELATION>___member_array_relation___</MBR_PROPOSER_RELATION>
                        <MBR_EDUCATION></MBR_EDUCATION>
                        <MBR_OCCUPATION>___member_array_occupation___</MBR_OCCUPATION>
                        <MBR_PAST_PROPOSAL>No</MBR_PAST_PROPOSAL>
                        <MBR_IS_PEP>___member_array_pep___</MBR_IS_PEP>
                        <MBR_SEX>___member_array_gender_2___</MBR_SEX>
                        <FAMILY_HISTORY>___member_array_question_1_details___</FAMILY_HISTORY>
                        <CANCER_DISORDERS>___member_array_question_2_details___</CANCER_DISORDERS>
                        <KIDNEY_DISORDERS>___member_array_question_3_details___</KIDNEY_DISORDERS>
                        <HEART_DISORDERS>___member_array_question_4_details___</HEART_DISORDERS>
                        <LUNG_DISORDERS>___member_array_question_5_details___</LUNG_DISORDERS>
                        <STOMATCH_DISORDERS>___member_array_question_6_details___</STOMATCH_DISORDERS>
                        <PHYSCHIATRIC_DISORDERS>___member_array_question_7_details___</PHYSCHIATRIC_DISORDERS>
                        <ENDOCRINE_DISORDERS>___member_array_question_8_details___</ENDOCRINE_DISORDERS>
                        <BONE_DISORDERS>___member_array_question_9_details___</BONE_DISORDERS>
                        <EAR_DISORDERS>___member_array_question_10_details___</EAR_DISORDERS>
                        <GYNAECOLOGICAL_DISORDERS>___member_array_question_11_details___</GYNAECOLOGICAL_DISORDERS>
                        <BLOOD_RELATED_DISORDERS>___member_array_question_12_details___</BLOOD_RELATED_DISORDERS>
                        <SKIN_DISORDERS>___member_array_question_13_details___</SKIN_DISORDERS>
                        <OTHER_CONDITIONS>___member_array_question_25_details___</OTHER_CONDITIONS>
                        <MBR_IS_DIABETES>___member_array_question_14_details___</MBR_IS_DIABETES>
                        <INSULIN>___member_array_question_15_details___</INSULIN>
                        <ORAL_DIABETIC_MEDICATION>___member_array_question_16_details___</ORAL_DIABETIC_MEDICATION>
                        <HOMEOPATHI_AYUSH_TREATMENT>___member_array_question_27_details___</HOMEOPATHI_AYUSH_TREATMENT>
                        <NO_MEDICINE>___member_array_question_28_details___</NO_MEDICINE>
                        <DIABETES_YEARS_COUNT>___member_array_question_17_details___</DIABETES_YEARS_COUNT>
                        <MBR_IS_HYPERTENSION>___member_array_question_18_details___</MBR_IS_HYPERTENSION>
                        <MEDICINE_DETAILS>___member_array_question_29_details___</MEDICINE_DETAILS>
                        <HYPERTENSION_YEARS_COUNT>___member_array_question_19_details___</HYPERTENSION_YEARS_COUNT>
                        <MBR_CURRENTLY_PREGNANT>___member_array_pregnancy_information_subQue_1___</MBR_CURRENTLY_PREGNANT>
                        <MBR_IS_PREMATURE_DELIVERY>___member_array_pregnancy_information_subQue_2___</MBR_IS_PREMATURE_DELIVERY>
                        <MBR_IS_COMPLICATED_PREGNANCY>___member_array_pregnancy_information_subQue_3___</MBR_IS_COMPLICATED_PREGNANCY>
                        <MBR_IS_UNDERGONE_ABORTION>___member_array_pregnancy_information_subQue_4___</MBR_IS_UNDERGONE_ABORTION>
                        <MBR_NUMBER_OF_PREGNANCIES>___member_array_pregnancy_information_subQue_5___</MBR_NUMBER_OF_PREGNANCIES>
                        <NO_OF_LIVE_BIRTH>___member_array_pregnancy_information_subQue_6___</NO_OF_LIVE_BIRTH>
                        <IS_BABY></IS_BABY>
                        <MEDICAL_SF_QUESTIONS>
                            <SF_QUESTION_1>___member_array_question_21_details___</SF_QUESTION_1>
                            <SF_QUESTION_2>___member_array_question_22_details___</SF_QUESTION_2>
                            <SF_QUESTION_3>___member_array_question_23_details___</SF_QUESTION_3>
                            <SF_QUESTION_4>___member_array_question_24_details___</SF_QUESTION_4>
                        </MEDICAL_SF_QUESTIONS>
                        <ADDITIONAL_MEDICAL_DETAIL>
                            <QUESTION></QUESTION>
                            <SYMPTOMS>___member_array_additionalQue_1_subQue_1___</SYMPTOMS>
                            <SYMPTOMS_DATE>___member_array_additionalQue_1_subQue_4___</SYMPTOMS_DATE>
                            <TREATMENT>___member_array_additionalQue_1_subQue_2___</TREATMENT>
                            <OUTCOME_TREATMENT>___member_array_additionalQue_1_subQue_3___</OUTCOME_TREATMENT>
                            <DETAILS_OF_TREATMENT>___member_array_additionalQue_1_subQue_7___</DETAILS_OF_TREATMENT>
                            <DETAILS_OF_DOCTOR_OR_HOSPITAL>___member_array_additionalQue_1_subQue_6___</DETAILS_OF_DOCTOR_OR_HOSPITAL>
                            <DURATION_CONDITION>___member_array_additionalQue_1_subQue_5___</DURATION_CONDITION>
                        </ADDITIONAL_MEDICAL_DETAIL>
                        <!--___member_array_block2_Start-->
                        <ADDITIONAL_MEDICAL_DETAIL>
                            <QUESTION></QUESTION>
                            <SYMPTOMS>___member_array_additionalQue_2_subQue_1___</SYMPTOMS>
                            <SYMPTOMS_DATE>___member_array_additionalQue_2_subQue_4___</SYMPTOMS_DATE>
                            <TREATMENT>___member_array_additionalQue_2_subQue_2___</TREATMENT>
                            <OUTCOME_TREATMENT>___member_array_additionalQue_2_subQue_3___</OUTCOME_TREATMENT>
                            <DETAILS_OF_TREATMENT>___member_array_additionalQue_2_subQue_7___</DETAILS_OF_TREATMENT>
                            <DETAILS_OF_DOCTOR_OR_HOSPITAL>___member_array_additionalQue_2_subQue_6___</DETAILS_OF_DOCTOR_OR_HOSPITAL>
                            <DURATION_CONDITION>___member_array_additionalQue_2_subQue_5___</DURATION_CONDITION>
                        </ADDITIONAL_MEDICAL_DETAIL>
                        <!--___member_array_block2_End-->
                    </INSURED_DETAIL>
                    <!--InsurersDetail_End-->
                </INSURED_DETAILS>
            </APPLICATION_FORM>
        ]]></tem:strXML>
            <!--Optional:-->
            <tem:AccessKey>UseQlVYMBLMRfIVQoTGm8oboCDRYTlEqK58DvKTWbYdChxJppMvbc+uRDRzuL7Bar9c1Bo5v2M9pgQ4a81ifAsNT7yQOmgB2yLT9YtyddFx3g5nGt85InFIz4O7YMomapmLTlz//uAQzpooex1jm0eBNfi1o2D+TINCsrpXiI5i7BDUwGF6rZTOYqWY0L/2XbNGocRkzfV6SjdM8de9yKqiIVMCgxVuiwORIQ92ex3Nwej7EK97kVqVXGaj+fviPJ8EDn7FOE7FDo/CaGC4YJkfdnfo7grNWzXIWKuWT6wTocPv1GxoS2rIAw4IvU4hE</tem:AccessKey>
        </tem:GetUWDecision>
    </soapenv:Body>
</soapenv:Envelope>